harmony.common.security/target/classes/data/ValidCancelRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://localhost:8080/harmony-adapter-dummy/services/Reservation</wsa:To>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://ist_phosphorus.eu/nsp/webservice/reservation/cancelReservation</wsa:Action>
        <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">uuid:16c6fae5-1600-a08e-b315-13401ab6e60b</wsa:MessageID>
        <wsa:From xmlns:wsa="http://www.w3.org/2005/08/addressing">
            <wsa:Address>http://www.w3.org/2005/08/addressing/role/anonymous</wsa:Address>
        </wsa:From>
    </soap:Header>
    <soap:Body>
        <pfx0:cancelReservation xmlns:pfx0="http://ist_phosphorus.eu/nsp/webservice/reservation">
            <pfx0:cancelReservation
                xmlns="http://ist_phosphorus.eu/nsp/webservice/notification"
                xmlns:ns2="http://ist_phosphorus.eu/nsp/webservice/reservation"
                xmlns:ns3="http://ist_phosphorus.eu/nsp"
                xmlns:ns4="http://www.w3.org/2005/08/addressing"
                xmlns:ns5="http://ist_phosphorus.eu/nsp/webservice/topology" xmlns:ns6="http://docs.oasis-open.org/wsrf/bf-2">
                <ns2:cancelReservation xmlns:ns2="http://ist_phosphorus.eu/nsp/webservice/reservation">
                    <ns2:ReservationID>1</ns2:ReservationID>
                </ns2:cancelReservation>
            </pfx0:cancelReservation>
        </pfx0:cancelReservation>
    </soap:Body>
</soap:Envelope>
